using System;
using System.Collections.Generic;

class Program
{
    static void Main(string[] args)
    {
        string[] days = {"Тридцать первое", "Перове", "Второе", "Третье", "Четвертое", "Пятое", "Шестое",
        "Седьмое", "Восьмое", "Девятое", "Десятое", "Одинадцатое", "Двенадцатое", "Тринадцатое",
        "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое",
        "Двадцатое", "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвертое",
        "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое",
        "Тридцатое"};

        string[] months = { "Декабря", "Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля",
        "Августа", "Сентября", "Октября", "Ноября"};

        Console.Write("Введите день: ");
        int d = int.Parse(Console.ReadLine());

        Console.Write("Введите месяяц: ");
        int m = int.Parse(Console.ReadLine());

        Console.WriteLine($"{days[d % 31]} {months[m % 12]}");
    }
}